Revit 2027 API
PointLocationOnCurve.MeasurementValue Property
 The measurement value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MeasurementValue { get; set; }
Public Property MeasurementValue As Double
	Get
	Set
public:
property double MeasurementValue {
	double get ();
	void set (double value);
}
member MeasurementValue : float with get, set
Property Value
Double
Remarks
 The measurement value is not checked until this class is assigned for a particular reference point on a particular curve. At that time, the measurement value must match the expected range for the curve for the given measurement type and measure-from.
See Also
Reference
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace